In [1]:
import pandas as pd;
pd.set_option('display.max_colwidth', None)  # No truncation for column values
pd.set_option('display.expand_frame_repr', False)

In [2]:
product_list = pd.read_excel('Project Dataset/Business Department/product_list.xlsx')
product_list

     Unnamed: 0    product_id                    product_name                product_type  price
0             0  PRODUCT16794  Grandmas swedish thin pancakes         readymade_breakfast  12.81
1             1  PRODUCT61957          Chili jack oven omelet         readymade_breakfast   9.95
2             2  PRODUCT23890                     Baked pears         readymade_breakfast  10.04
3             3  PRODUCT52912        Best buttermilk pancakes         readymade_breakfast   5.83
4             4  PRODUCT56387       Blackberry breakfast bars         readymade_breakfast  14.00
..          ...           ...                             ...                         ...    ...
745         445  PRODUCT35203                          tomato                     grocery  17.28
746         446  PRODUCT34682                            bowl                 kitchenware  17.28
747         447  PRODUCT07137                    dehumidifier  electronics and technology  38.07
748         448  PRODUCT29484                            rice                     grocery  17.28
749         449  PRODUCT22046                  dove deodorant          health and hygiene   6.11

[750 rows x 5 columns]

In [28]:
#Check if all product IDs are unique
unique_id_count = product_list['product_id'].nunique()
print("Unique products (750 expected): " + str(unique_id_count))

#Return all rows with duplicate product IDs
product_list = product_list.sort_values(by='product_id')
duplicates = product_list[product_list['product_id'].duplicated(keep=False)]
print("Duplicated product IDs: ")
print(duplicates)

Unique products (750 expected): 743
Duplicated product IDs:
     Unnamed: 0    product_id                                          product_name                    product_type  price
40           40  PRODUCT10592  Scrambled egg sandwiches with onions and red peppers             readymade_breakfast  13.18
437         137  PRODUCT10592                                            tooth pick              health and hygiene   6.11
684         384  PRODUCT19599                                    Christmas ornament                       furniture  38.07
680         380  PRODUCT19599                                            oslo paper  stationary and school supplies   5.74
542         242  PRODUCT38223                                          fishing hook                     accessories   5.74
499         199  PRODUCT38223                                            safety pin                     accessories   5.74
327          27  PRODUCT47439                                      pair of scissors                           tools  17.28
62           62  PRODUCT47439                                            Purple cow             readymade_breakfast  10.89
462         162  PRODUCT50527                                               slipper                         apparel  17.28
509         209  PRODUCT50527                                                  sofa                       furniture  38.07
44           44  PRODUCT61036                  Blueberry banana happy face pancakes             readymade_breakfast   8.09
589         289  PRODUCT61036                                    pair of binoculars                           tools  17.28
150          50  PRODUCT62030   Delicious cheesy bacon and green onion potato skins                 readymade_lunch  19.76
401         101  PRODUCT62030                                             chocolate                         grocery  17.28

In [33]:
#check for nulls in the entire table
nulls = product_list.isnull().sum()
print("Null values in each column: ")
print(nulls)

print(product_list[product_list['product_type'].isnull()])

Null values in each column:
Unnamed: 0      0
product_id      0
product_name    0
product_type    1
price           0
dtype: int64
     Unnamed: 0    product_id     product_name product_type  price
736         436  PRODUCT58030  bottle of paint          NaN  21.26

In [ ]:
#check if product names are all unique
unique_productname_count = product_list['product_name'].nunique()
print("Unique product names (750 expected): " + str(unique_productname_count))
duplicates2 = product_list[product_list['product_name'].duplicated(keep=False)]
print("Duplicated product names: ")
print(duplicates2)

In [3]:
user_credit_card = pd.read_pickle('Project Dataset/Customer Management Department/user_credit_card.pickle')
user_credit_card

        user_id              name  credit_card_number   issuing_bank
0     USER40678        Zion Feest          4294956114            bpi
1     USER08728  Kattie Bergstrom          2742902159            bdo
2     USER29759      Aiden Corwin          1917471950            bdo
3     USER16806    Vince Gislason          3290792253      chinabank
4     USER27644     Adele Okuneva          2313395832      chinabank
...         ...               ...                 ...            ...
4995  USER49969   Kendall Waelchi          1870581879      chinabank
4996  USER57209  Lucious Kshlerin          1139377065       mayabank
4997  USER36424    Cordie Jenkins          2187584552  robinsonsbank
4998  USER45166        Tyrel Feil          2542420860            bdo
4999  USER54154       Betty Zieme          4104712921   securitybank

[5000 rows x 4 columns]

In [26]:
#check if all user IDs are unique
unique_userid_count = user_credit_card['user_id'].nunique()
print("Unique user IDs (5000 expected):" + str(unique_userid_count))

#return all duplicated user IDs
user_credit_card = user_credit_card.sort_values(by="user_id")
duplicates3 = user_credit_card[user_credit_card['user_id'].duplicated(keep=False)]
print("Duplicated User ID rows")
print(duplicates3)

Unique user IDs (5000 expected):4791
Duplicated User ID rows
        user_id                name  credit_card_number issuing_bank
366   USER00304           Tom Welch          1356102080          bdo
554   USER00304       Mariam Kemmer          2209453432     eastwest
1230  USER00393       Shaina Bailey          2603941907          bdo
440   USER00393       Liliane Smith          2345218200          bdo
775   USER00473        Camron Stehr          2711230664    chinabank
...         ...                 ...                 ...          ...
3764  USER64103           Ed Conroy           764327459     eastwest
3671  USER64103  Cristopher Padberg          3844046888     mayabank
4214  USER64913        Petra Hansen          3820689844          bdo
4104  USER64913         Kaia Heaney           299170808    metrobank
738   USER64913   Madisen Bahringer          2256946049    chinabank

[412 rows x 4 columns]

In [30]:
#check if all user names are unique
unique_usernames_count = user_credit_card['name'].nunique()
print("Unique user names (5000 expected):" + str(unique_usernames_count))

#return all duplicated user IDs
user_credit_card = user_credit_card.sort_values(by="name")
duplicates4 = user_credit_card[user_credit_card['name'].duplicated(keep=False)]
print("Duplicated user name rows")
print(duplicates4)

Unique user names (5000 expected):4992
Duplicated user name rows
        user_id              name  credit_card_number   issuing_bank
2940  USER64643      Avery Reilly          3157670654       mayabank
1010  USER28790      Avery Reilly           952044179      metrobank
4650  USER13527    Colton OReilly          1301814077            bdo
4839  USER50417    Colton OReilly          1932677891      chinabank
4811  USER28692  Eduardo Mosciski          2514974081   securitybank
4910  USER21354  Eduardo Mosciski          3237489303      chinabank
1853  USER05951    Juanita Beahan          1633670600      metrobank
2673  USER37395    Juanita Beahan          3527602678      metrobank
1200  USER36608       Juwan Hintz          2065216590       eastwest
1130  USER18695       Juwan Hintz          3688342974            bdo
3492  USER15885    Kathryne Bosco          3750735007  robinsonsbank
150   USER56658    Kathryne Bosco           359494374       mayabank
1993  USER10216       Kody Rempel          3141144368       mayabank
3382  USER44370       Kody Rempel          3093818101       mayabank
2036  USER45050     Nya Abernathy          2859806841            bdo
2293  USER44994     Nya Abernathy           138972125      metrobank

In [31]:
#check if all credit card numbers are unique
unique_ccno_count = user_credit_card['credit_card_number'].nunique()
print("Unique credit card numbers (5000 expected):" + str(unique_ccno_count))

#return all duplicated credit card numbers
user_credit_card = user_credit_card.sort_values(by="credit_card_number")
duplicates5 = user_credit_card[user_credit_card['credit_card_number'].duplicated(keep=False)]
print("Duplicated credit card numbers rows")
print(duplicates5)

Unique credit card numbers (5000 expected):5000
Duplicated credit card numbers rows
Empty DataFrame
Columns: [user_id, name, credit_card_number, issuing_bank]
Index: []

In [ ]:
# check for null columns in the credit card data
nulls2 = user_credit_card.isnull().sum()
print("Null values in each column: ")
print(nulls2)

Null values in each column:
user_id               0
name                  0
credit_card_number    0
issuing_bank          0
dtype: int64

In [5]:
user_data = pd.read_json('Project Dataset/Customer Management Department/user_data.json')
user_data

        user_id        creation_date              name                      street           state        city                country            birthdate  gender     device_address user_type
0     USER40678  2021-03-17 22:56:13        Zion Feest       14938 West Trace side      New Jersey  Birmingham              Hong Kong  1998-04-06 05:29:37    male  17:fb:f2:60:94:4b     basic
1     USER08728  2022-10-10 12:53:20  Kattie Bergstrom        4476 West Haven fort         Alabama      Irvine                Mayotte  2003-05-22 11:16:19    male  b0:17:a7:0b:d6:67   premium
2     USER29759  2020-05-20 04:34:44      Aiden Corwin   59980 North Crest chester  North Carolina       Tampa                   Iraq  2008-08-29 16:42:05  female  24:f2:0b:88:2f:bd     basic
3     USER16806  2021-05-28 07:36:30    Vince Gislason            541 Radial mouth        Illinois     Orlando            New Zealand  2012-02-09 14:12:37    male  a4:f5:fd:fe:07:f9     basic
4     USER27644  2023-03-16 19:25:35     Adele Okuneva               896 Glen bury         Arizona        Reno                 Mexico  1976-10-13 00:53:54    male  ac:80:b3:bc:8d:5f   premium
...         ...                  ...               ...                         ...             ...         ...                    ...                  ...     ...                ...       ...
4995  USER49969  2021-11-18 19:04:30   Kendall Waelchi      792 North Manors haven         Florida   San Diego                 Jersey  1996-03-11 09:05:32  female  8e:57:7e:62:90:b4     basic
4996  USER57209  2022-03-27 09:17:43  Lucious Kshlerin         48282 Burgs chester        Kentucky     Garland               Ethiopia  2013-07-07 08:53:27  female  00:35:b5:e4:e1:aa     basic
4997  USER36424  2022-10-05 21:36:56    Cordie Jenkins  8928 North Mountains haven    North Dakota  Scottsdale                  Tonga  1991-05-18 05:07:36    male  0b:0d:57:d6:c1:ab     basic
4998  USER45166  2020-07-20 03:51:41        Tyrel Feil          920 New Manor port    Rhode Island   Arlington  Virgin Islands (U.S.)  1975-12-19 02:27:16    male  83:c9:1e:4e:52:f4   premium
4999  USER54154  2020-05-13 08:43:26       Betty Zieme       19808 North Pass side        Colorado     Detroit                 Zambia  2010-02-21 02:56:06  female  4c:fb:dc:fb:b7:e7   premium

[5000 rows x 11 columns]

In [36]:
nulls3 = user_data.isnull().sum()
print("Null values in each column: ")
print(nulls3)

Null values in each column:
user_id           0
creation_date     0
name              0
street            0
state             0
city              0
country           0
birthdate         0
gender            0
device_address    0
user_type         0
dtype: int64

In [37]:
#check if all user ids are unique
unique_userid2_count = user_data['user_id'].nunique()
print("Unique user data (5000 expected):" + str(unique_userid2_count))

#return all duplicated user id rows
user_data = user_data.sort_values(by="user_id")
duplicates6 = user_data[user_data['user_id'].duplicated(keep=False)]
print("Duplicated user id rows")
print(duplicates6)

Unique user data (5000 expected):4791
Duplicated user id rows
        user_id        creation_date                name                  street           state           city           country            birthdate  gender     device_address user_type
366   USER00304  2022-02-26 23:45:04           Tom Welch  6161 Lake Plains haven      New Mexico      Charlotte        Seychelles  1990-05-31 21:51:53    male  3f:ac:2b:19:0e:a5     basic
554   USER00304  2020-09-24 17:46:58       Mariam Kemmer           8376 Hill ton        Colorado   Indianapolis              Mali  1973-06-25 19:24:02    male  ab:80:d2:7c:98:76     basic
1230  USER00393  2022-08-06 02:47:01       Shaina Bailey       27558 Shores furt         Alabama           Mesa            Brazil  1995-01-15 16:28:17  female  a5:25:61:fd:a3:9f     basic
440   USER00393  2022-10-16 17:26:09       Liliane Smith    4315 West Lodge town         Florida     Cincinnati              Iraq  1973-06-08 08:48:19    male  31:c7:99:cf:1f:cb  verified
775   USER00473  2023-03-10 07:52:20        Camron Stehr     9987 Port Neck side      California        Anaheim            Brazil  1988-12-12 01:34:45    male  86:ee:ae:92:d0:53     basic
...         ...                  ...                 ...                     ...             ...            ...               ...                  ...     ...                ...       ...
3764  USER64103  2021-08-26 00:09:03           Ed Conroy       929 Valleys burgh      New Jersey         Denver             India  2014-02-06 08:37:54  female  23:0a:9c:21:77:d0  verified
3671  USER64103  2020-12-20 18:12:22  Cristopher Padberg         9814 Brook view  South Carolina  Winston-Salem  Marshall Islands  1975-12-13 03:29:50  female  05:d6:72:2c:56:ce     basic
4214  USER64913  2022-08-27 13:50:05        Petra Hansen         531 Divide bury           Texas        Atlanta             Macao  1999-08-01 16:36:38    male  e1:41:49:07:24:6c     basic
4104  USER64913  2023-09-07 07:06:50         Kaia Heaney     981 New Circle furt  North Carolina           Reno           RÃ©union  1994-03-30 13:27:29  female  7d:02:5d:be:2e:1c     basic
738   USER64913  2021-02-23 08:39:38   Madisen Bahringer  61911 New Groves ville         Florida           Reno   Solomon Islands  1972-05-02 15:59:08  female  aa:aa:d6:64:4d:8b     basic

[412 rows x 11 columns]

In [39]:
user_job = pd.read_csv('Project Dataset/Customer Management Department/user_job.csv')
user_job

      Unnamed: 0    user_id              name       job_title   job_level
0              0  USER40678        Zion Feest      Technician    Accounts
1              1  USER08728  Kattie Bergstrom      Technician   Solutions
2              2  USER29759      Aiden Corwin         Student         NaN
3              3  USER16806    Vince Gislason         Student         NaN
4              4  USER27644     Adele Okuneva       Associate   Usability
...          ...        ...               ...             ...         ...
4995        4995  USER49969   Kendall Waelchi     Facilitator  Directives
4996        4996  USER57209  Lucious Kshlerin         Student         NaN
4997        4997  USER36424    Cordie Jenkins  Representative  Directives
4998        4998  USER45166        Tyrel Feil      Supervisor     Metrics
4999        4999  USER54154       Betty Zieme         Student         NaN

[5000 rows x 5 columns]

In [41]:
#check for nulls in the entire table
nulls4 = user_job.isnull().sum()
print("Null values in each column: ")
print(nulls4)

print(user_job[user_job['job_level'].isnull()])

Null values in each column:
Unnamed: 0       0
user_id          0
name             0
job_title        0
job_level     1629
dtype: int64
      Unnamed: 0    user_id              name job_title job_level
2              2  USER29759      Aiden Corwin   Student       NaN
3              3  USER16806    Vince Gislason   Student       NaN
5              5  USER00616    Joshuah Jacobi   Student       NaN
11            11  USER24692      Kaci Schmidt   Student       NaN
12            12  USER15171    Junius Watsica   Student       NaN
...          ...        ...               ...       ...       ...
4991        4991  USER16526    Bridie Collins   Student       NaN
4992        4992  USER63608    Carmel Hermann   Student       NaN
4994        4994  USER55414      Gregory Hand   Student       NaN
4996        4996  USER57209  Lucious Kshlerin   Student       NaN
4999        4999  USER54154       Betty Zieme   Student       NaN

[1629 rows x 5 columns]

In [52]:
user_job = user_job.sort_values(by='user_id')

unique_userid3_count = user_job['user_id'].nunique()
print("Unique user data (5000 expected):" + str(unique_userid3_count))

#return all duplicated user id rows
duplicates7 = user_job[user_job['user_id'].duplicated(keep=False)]
print("Duplicated user id rows")
print(duplicates7)

Unique user data (5000 expected):4791
Duplicated user id rows
      Unnamed: 0    user_id                name     job_title      job_level
366          366  USER00304           Tom Welch       Liaison    Integration
554          554  USER00304       Mariam Kemmer     Associate      Usability
1230        1230  USER00393       Shaina Bailey    Specialist       Research
440          440  USER00393       Liliane Smith  Orchestrator   Applications
775          775  USER00473        Camron Stehr   Facilitator  Configuration
...          ...        ...                 ...           ...            ...
3764        3764  USER64103           Ed Conroy       Student            NaN
3671        3671  USER64103  Cristopher Padberg       Student            NaN
4214        4214  USER64913        Petra Hansen  Orchestrator       Mobility
4104        4104  USER64913         Kaia Heaney     Executive       Branding
738          738  USER64913   Madisen Bahringer       Planner       Security

[412 rows x 5 columns]

In [9]:
users1 = user_data[['user_id','name','creation_date']].copy()
users1 = users1.sort_values(by='creation_date')
users1['new_id'] = ['USER{:05d}'.format(i) for i in range(1,len(users1)+1)]
users1

        user_id                name        creation_date     new_id
2547  USER42753     Melisa Jacobson  2020-01-01 08:22:55  USER00001
4483  USER38021   Garfield Reynolds  2020-01-01 09:42:19  USER00002
3533  USER29148      Amos Marquardt  2020-01-01 10:18:50  USER00003
1633  USER63885   Brendan Halvorson  2020-01-01 14:10:01  USER00004
3248  USER20829         Gerda Bauch  2020-01-02 09:31:05  USER00005
...         ...                 ...                  ...        ...
880   USER42291     Rickie Johnston  2023-11-27 13:28:06  USER04996
1408  USER06245  Fabiola Swaniawski  2023-11-27 22:31:41  USER04997
1393  USER49691         Bria Reilly  2023-11-29 03:45:35  USER04998
629   USER35826           Alex Dare  2023-11-29 15:15:37  USER04999
107   USER20411    Mohamed McKenzie  2023-11-30 06:53:17  USER05000

[5000 rows x 4 columns]